docs/mathematics/linear_algebra/KBrefComplexOperatorsHaveEigenvalues.tex
% Created 2021-09-12 Sun 22:49
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Axler5.21 Complex vector spaces have eigenvalues}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Axler5.21 Complex vector spaces have eigenvalues},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Axler5.21 Complex Vector Spaces have atleast one eigenvalue}
\label{sec:org0f5b3d0}
\begin{quote}
Every operator on a finite-dimensional, nonzero, complex vector space has an eigenvalue.
\end{quote}
\section{intuition}
\label{sec:org53db4c7}
\subsection{by the fundamental theorem of algebra, the characteristic polynomial will have roots and thus there will be eigenvalues.}
\label{sec:org5f25050}
\section{proof}
\label{sec:org3bafa6f}
\subsection{by factoring, we turn the polynomial of maps into a composition of linear maps of the form \((T-\lambda I)\) and the input vector has to go to all of them. We choose a \(v\) s.t. it should be equal to zero, which means that one of the maps needs to send the \(v\) to zero (and that map will be injective and that lambda will be an eigenvalue).}
\label{sec:orgd713451}
\subsection{to formalize the "one of the maps sends the input to zero," you can just use a prev proof "if a chain of maps is not injective, then one of the maps is not injective" or induct because there is a finite number of maps.}
\label{sec:orgad2a1c6}
\end{document}
